# StructuralSectionIweldedBottomflangethickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIweldedBottomflangethickness Property
ParameterTypeId Class See Also
---
"Bottom Flange Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIweldedBottomflangethickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIweldedBottomflangethickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIweldedBottomflangethickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace